app/controllers/pages_controller.rb

SELECT COUNT(*) FROM "events" WHERE "events"."description" = $1 AND "events"."to_do" = $2  [["description", "révision de loyer"], ["to_do", "t"]]
SELECT COUNT(*) FROM "events" WHERE "events"."to_do" = $1  [["to_do", "t"]]
SELECT COUNT(*) FROM "events" WHERE "events"."emergency_level" = $1 AND "events"."to_do" = $2  [["emergency_level", "urgent"], ["to_do", "t"]]
SELECT "events".* FROM "events" WHERE "events"."status" = $1 AND "events"."emergency_level" = $2 AND "events"."to_do" = $3  [["status", "tenant_to_notify"], ["emergency_level", "urgent"], ["to_do", "t"]]
SELECT "balance_days".* FROM "balance_days"
---
  def home
    @user = current_user

    #Cards data

    @nbr_rent_rev = Event.where(description: 'révision de loyer', to_do: true).count
    @nbr_late_rent = Event.where(description: 'retard loyer', to_do: true).count
    @nbr_end_lease = Event.where(description: 'fin de bail', to_do: true).count
    @nbr_total = Event.where(to_do: true).count

    @nbr_urgent = Event.where(emergency_level: 'urgent', to_do: true).count
    @nbr_urgent_prog = Event.where(emergency_level: 'urgent', to_do: true).count
    @nbr_urgent_t = Event.where(emergency_level: 'urgent').count

    # Circular progress bar data:
    @percentage_done = ((@nbr_urgent.fdiv(@nbr_urgent_t) + @nbr_urgent_prog.fdiv(@nbr_urgent_t*2))*100)

    @percentage_finished = (((@nbr_urgent_t - @nbr_urgent).fdiv(@nbr_urgent_t)) * 100)
    p = 0
    Event.where(status: 'tenant_to_notify', emergency_level: 'urgent', to_do: true).each do |e|
      p += 1 if e.description != 'retard loyer'
    end
    @percentage_progress = (p.fdiv(@nbr_urgent_t)*100)
    @percentage_done = (@percentage_progress/2) + @percentage_finished

    # Graph data:
    @labels = []
    @data_overdue = []
    @data_rents = []
    BalanceDay.all.each do |b|